---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.#ctor
source: html/8be72333-014a-c341-2afc-ad8ea816358e.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.#ctor Method

Constructs default options for energy analysis detailed model creation.

## Syntax (C#)
```csharp
public EnergyAnalysisDetailModelOptions()
```